simpleProcess/airfoil_OFJ_pitching/mesh/rotating/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o., Tue Feb 28 09:23:31 2017               |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "mesh/component2/system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name rotorSet;
        type cellSet;
        action clear;
    }
    {
        name rotorSet;
        type cellSet;
        action invert;
    }
    {
        name shape;
        type cellZoneSet;
        action new;
        source setToCellZone;
        sourceInfo
        {
            set rotorSet;
        }
    }
);

// ************************************************************************* //
